#include <iostream>
#include "ArrayList.h"

using namespace std;

int main()
{

	return EXIT_SUCCESS;
}



/*
ѕосле реализации функций(там немного, честно), нужно решить с использованием вашей структуры следующие задачи.
1).ƒобавить в список 10 случайных положительных двузначных чисел и вывести список
2).ƒобавить в список 10 случайных отрицательных двузначных чисел и вывести список
3).ѕомен€ть местами первый минимальный и последний максимальный элемент и вывести список
4).ѕеремешать все элементы массива и вывести массив.
5).«аменить каждый отрицательный элемент массива на 0.*/